read_verilog -netlist ../netlist/IIR_LH.v
read_saif -input ../saif/IIR_LH_syn.saif -instance tb_iir_lah/UUT -unit ns -scale 1
create_clock -name MY_CLK CLK
report_power > report_power_LH.txt
